[
  {
    "product_name": " MASESTER® E7000 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masester-e7000",
    "product_details": {
      "description": "MASESTER® E7000 is a versatile, palm-based ingredient derived from fractionated fatty acids (mainly caprylic and capric acids) and refined glycerine. This odorless product finds applications across the flavor, food, and beverage sectors, as well as the pharmaceutical industry. Serving as a solubilizer, clouding agent, excipient, and wetting agent, MASESTER® E7000 seamlessly enhances formulations.",
      "INCI Name": "Caprylic/Capric Triglyceride",
      "Function": "Conditioner, Emollient, Viscosity Modifier, Re-Fatting Agent, Clouding Agent",
      "Labeling Claims": "Ulta Beauty's Conscious Beauty, Allergen-free, Credo Clean Standard, Halal, Organic, Clean at Sephora, Kosher, PHO (Partially Hydrogenated Oil)-Free, Non-GMO",
      "Certifications & Compliance": "Prop 65 Compliant, COSMOS, REACH (Europe), Vegan, Kosher, RSPO MassBalance Certified, CosIng Listed, Organic Certified, Halal, ISO 9001, EFfCI GMP Certified, Gluten-free, Non-GMO Project Verified, ISO 14001, EU Cosmetic Regulation 1223/2009 Compliant, ECOCERT, FSSC 22000, GMP, United States Pharmacopeia (USP)"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® DMG 9320-NH ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-dmg-9320-nh",
    "product_details": {
      "description": "MASEMUL® DMG 9320-NH is a distilled monoglyceride derived from refined palm-based oil. FUnctions include fats and oils, fatty acids and lipids, and emulsification. MASEMUL® DMG 9320-NH has food and nutrition applications that include beverages, food, and nutrition and well-being. ",
      "Ingredient Name": "Distilled Monoglycerides",
      "Function": "Fats & Oils, Fatty Acids & Lipids, Emulsifier",
      "Labeling Claims": "Halal, Kosher",
      "Certifications & Compliance": "FDA Approved, FSSC 22000, Halal, EU Compliant, Kosher, GFSI Certified, ISO 9001"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EB 1011 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-eb-1011",
    "product_details": {
      "description": "MASEMUL® EB 1011 is an emulsified vegetable fat designed to enhance bakery creations. As a bakery improver, MASEMUL® EB 1011 is crucial in maintaining softness, boosting bread volume, and ensuring excellent anti-staling properties. Experience its remarkable attributes, from imparting good dough extensibility to elevating your baked goods' quality.",
      "Ingredient Name": "Vegetable Fat",
      "Function": "Dough Conditioner, Fats & Oils",
      "Labeling Claims": "Halal, PHO (Partially Hydrogenated Oil)-Free, Kosher, Non-GMO",
      "Certifications & Compliance": "FSSC 22000, Halal, GFSI Certified, ISO 9001, RSPO Certified Sustainable Palm Oil, Kosher",
      "Features": "Easy To Use, Soft Texture, Improved Expansion, High Quality, Excellent Softness, Inhibits Staling, Improved Dough Machinability & Development"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® PGMS 9502 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-pgms-9502",
    "product_details": {
      "description": "MASEMUL® PGMS 9502 is a versatile ingredient with a significant role in cake mixes, ice cream, and whipping creams. It serves as both an Emulsifier and Whipping Agent, enhancing the texture and quality of various food products. Available in both beads and solid forms, MASEMUL® PGMS 9502 finds its applications across Bakery, Cooking oils and Fat products, and Savory and Culinary realms within the Food and Nutrition sector.",
      "Ingredient Name": "Propylene Glycol Monostearate",
      "Function": "Emulsifier, Whipping Agent",
      "Labeling Claims": "Kosher, GMO-free, Sustainable, Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal, Non-Hazardous",
      "Physical Form": "Beads, Solid",
      "Features": "Improved Expansion, Good whipping ability, Batter Stability, Improved Foam Stiffness, High Overrun, Uniform Texture"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® PGE 4060 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-pge-4060",
    "product_details": {
      "description": "MASEMUL® PGE 4060 is a liquid-state, proficient polyglycerol ester derived from the fusion of refined vegetable oil and polyglycerol. MASEMUL® PGE 4060 is used as an emulsifier, batter conditioner, and whipping agent in various food applications. From bakery and confectionery to convenience foods, cooking oils and fat products, dairy, desserts, and fruit preparations.",
      "Ingredient Name": "Polyglycerol Fatty Acid Esters",
      "Function": "Emulsifier, Batter Conditioner, Whipping Agent",
      "Labeling Claims": "Kosher, GMO-free, Sustainable, Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal, Non-Hazardous",
      "Certifications & Compliance": "FDA Approved, GFSI Certified, ISO 14001, RSPO Certified Sustainable Palm Oil, FCC Compliant, Halal, JECFA (FAO/WHO), ISO 9001, Kosher, FSSC 22000, EU Compliant, GMP",
      "Physical Form": "Liquid"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 1301 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-1301",
    "product_details": {
      "description": "MASBLEN® 1301 is a premium powder blend of food-grade emulsifiers and stabilizers. Crafted from non-animal, non-GMO origins, it excels in ice cream and milk ice recipes. Unlock exceptional air incorporation, ensuring a steady overrun for your frozen delights. Elevate your creations with MASBLEN® 1301.",
      "Function": "Emulsifier, Stabilizer",
      "Labeling Claims": "PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, Animal Products-free, Non-GMO",
      "Physical Form": "Powder",
      "Features": "Excellent Melt Resistance, Stabilizing, Cost Effective, Texturizing, Prevent Shrinkage"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® STS 2002 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-sts-2002",
    "product_details": {
      "description": "MASEMUL® STS 2002 is a sorbitan tristearate created from the fusion of refined vegetable fatty acids and sorbitol. It is an excellent Anti-Blooming Agent and Emulsifier. It seamlessly integrates into fats, compound coatings, and fillings, enhancing their properties. MASEMUL® STS 2002 has application in beverage and food applications.",
      "Ingredient Name": "Sorbitan Tristearate",
      "Function": "Anti-Blooming Agent, Emulsifier",
      "Labeling Claims": "PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, Non-GMO",
      "Features": "Improved Whiteness, Improves Whitening, Improved Mouthfeel"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASCID® 0850 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/mascid-0850",
    "product_details": {
      "description": "MASCID® 0850 is a versatile caprylic-capric acid blend that serves various roles across several industries.",
      "Ingredient Name": "Caprylic-Capric Acid Blend",
      "Chemical Name": "Fatty acids, C8-10",
      "Function": "Surfactant (Nonionic), Surfactant, Fatty Acids & Lipids, Intermediate, Defoamer",
      "CAS Number": "68937-75-7",
      "Chemical Family": "Organic Acids, Fatty Acids",
      "Synonyms": "C8-10 fatty acids"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 2101 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-2101",
    "product_details": {
      "description": "MASBLEN® 2101 is a powder blend of food-grade emulsifiers and stabilizers. Its components are made from raw materials of non-animal and non-GMO origin. Developed for blending into soft serve ice cream dry mix. It provides excellent melt resistance and good shape retention. It imparts a smooth and creamy texture for an improved sensory experience, good standup, and nice fluting characteristics. It also prevents serum separation and controls meltdown.",
      "Function": "Emulsifier, Stabilizer",
      "Labeling Claims": "Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, Animal Products-free",
      "Physical Form": "Powder",
      "Features": "Batter Aeration, Smooth Texture, Excellent Melt Resistance, Shape Retention, Creamy Texture, Creamy Mouthfeel, Improved Mouthfeel"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " Vitrenol® 30L ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/vitrenol-30l",
    "product_details": {
      "description": "Vitrenol® 30L is a natural liquid with a 30% Tocotrienol concentration, sourced from environmentally friendly and sustainable Palm oils. With an optimal 3:1 ratio of Tocotrienols to Tocopherols, Vitrenol® 30L is obtained through a unique solvent-free extraction technology from palm oil. Experience the benefits of Vitamin E with Vitrenol® 30L, a concentrated and chemical-free tocotrienol-rich fraction.",
      "Ingredient Name": "Tocotrienols",
      "Function": "Vitamin Source, Anti-Aging Agent",
      "Labeling Claims": "Kosher, Clean Label, Halal",
      "Certifications & Compliance": "Gluten-free, Prop 65 Compliant, Vegan, Halal, Non-GMO Project Verified, REACH Exempt (Europe), ISO 9001, Kosher, RSPO MassBalance Certified, FSSC 22000, GMP"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASCEROL™ Glycerine 99.7 USP, non-GMO, RSPO MB ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/musim-mas-group-mascerol-glycerine-99-7-usp-non-gmo-rspo-mb",
    "product_details": {
      "description": "MASCEROL™ Glycerine 99.7 USP, non-GMO, RSPO MB is highly refined with a minimum glycerol content of 99.7%. MASCEROL™ Refined Glycerine is used as a base ingredient in personal care preparations. It provides moisturizing properties and improves skin permeability.",
      "INCI Name": "Glycerin",
      "Ingredient Name": "Glycerin",
      "Function": "Anti-Freeze Agent, Plasticizer, Moisturizing Agent, Carrier, Conditioner, Emollient, Humectant, Viscosity Modifier, Re-Fatting Agent, Energy Sources, Supplement, Filler, Sugar Substitute, Thickener, Nutritive Sweetener, Binder, Deicing Agent, Surfactant, Solvent",
      "CAS Number": "56-81-5",
      "Chemical Family": "Polyols, Triols"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EF 2006 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ef-2006",
    "product_details": {
      "description": "MASEMUL® EF 2006 is a user-friendly food-grade emulsifier blend in convenient paste form, tailored for bakery premix manufacturers. This remarkable ingredient combines the benefits of various emulsifiers into one functional solution. Crafted from vegetable-based, non-GMO raw materials, MASEMUL® EF 2006 offers a seamless way to elevate your bakery creations.",
      "Ingredient Name": "Emulsifier Blend",
      "Function": "Emulsifier",
      "Ingredient Origin": "Natural Origin, Plant Origin, Vegetable Origin",
      "Labeling Claims": "Non-GMO, Allergen-free, Halal, Kosher, Naturally Derived",
      "Physical Form": "Paste",
      "End Uses": "Dough Premixes, Cake Mixes, Dry Mixes"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASCEROL™ Glycerine 99.7 USP, non-GMO ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/musim-mas-group-mascerol-glycerine-99-7-usp-non-gmo",
    "product_details": {
      "description": "MASCEROL™ Glycerine 99.7 USP, non-GMO is highly refined with a minimum glycerol content of 99,7%.",
      "INCI Name": "Glycerin",
      "Ingredient Name": "Glycerin",
      "Function": "Anti-Freeze Agent, Plasticizer, Moisturizing Agent, Carrier, Conditioner, Emollient, Humectant, Viscosity Modifier, Re-Fatting Agent, Energy Sources, Supplement, Filler, Sugar Substitute, Thickener, Nutritive Sweetener, Binder, Deicing Agent, Surfactant, Solvent",
      "CAS Number": "56-81-5",
      "Chemical Family": "Polyols, Triols"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 4101 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-4101",
    "product_details": {
      "description": "MASBLEN 4101 is an emulsifier and stabilizer that enhances the viscosity of plain and chocolate milk. It alters creaminess, thickness, chocolatey notes, and smoothness of milk. MASBLEN 4101 provides suspension and stabilization of insoluble particulates, such as cocoa powders, and was developed to provide suspension and stability in UHT dairy milk beverages.",
      "Function": "Emulsifier, Stabilizer",
      "Labeling Claims": "PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, Non-GMO",
      "Features": "Improved suspension, Improved Mouthfeel, Protein Stabilization"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASCID® 0898 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/mascid-0898",
    "product_details": {
      "description": "MASCID® 0898 is a versatile ingredient that serves various roles across several industries. In the realm of personal care, it contributes to fragrances and perfumes, enhancing the sensory experience of products. In chemical and industrial manufacturing, it acts as an intermediate and defoamer, optimizing processes and formulations. Additionally, in food and nutrition, it supports nutraceuticals and supplements, adding value to dietary products. In the field of agriculture and feed, it aids in agricultural pest control by promoting effective practices. Furthermore, within Healthcare and Pharma, it plays a significant role in API manufacturing and pharmaceutical processing, contributing to critical health-related procedures.",
      "Ingredient Name": "Caprylic Acid",
      "Chemical Name": "Octanoic acid",
      "Function": "Surfactant (Nonionic), Surfactant, Fatty Acids & Lipids, Intermediate, Defoamer",
      "CAS Number": "124-07-2",
      "Chemical Family": "Fatty Acids, Organic Acids",
      "Synonyms": "1-Heptanecarboxylic Acid, Caprylic Acid, N-Caprylic Acid, N-Octanoic Acid, N-Octoic Acid, N-Octylic Acid, Neo-Fat 8, Octoic Acid, Octylic Acid"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 4102 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-4102",
    "product_details": {
      "description": "MASBLEN 4102 is a viscosity-enhancing marvel for both plain and chocolate milk. This exceptional blend heightens the perception of creaminess, thickness, chocolatey notes, and smoothness in milk. It suspends and stabilizes insoluble particulates like cocoa powders, ensuring an indulgent sensory journey with excellent mouthfeel. Developed with precision, MASBLEN 4102 guarantees suspension and stability in UHT dairy milk beverages, promising a delightful and consistent treat. See below for recipe suggestion and other information.",
      "Function": "Emulsifier, Stabilizer",
      "Labeling Claims": "PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, Non-GMO",
      "Features": "Improved suspension, Improved Mouthfeel, Excellent Mouthfeel, Protein Stabilization"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 6101 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-6101",
    "product_details": {
      "description": "MASBLEN 6101 is a specialized blend of carefully chosen emulsifiers and hydrocolloids. Tailored for pasteurized, non-dairy whipped toppings containing caseinate, it promises exceptional performance. Crafted as a powder blend of food-grade emulsifiers and stabilizers, its components hail from non-animal, non-GMO sources.",
      "Function": "Emulsifier, Whipping Agent",
      "Labeling Claims": "PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, GMO-free, Non-GMO",
      "Features": "Improved Freeze/Thaw Stability, Non-Dairy, High Overrun"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 1201 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-1201",
    "product_details": {
      "description": "MASBLEN® 1201 is an optimized emulsifier and hydrocolloid ice cream blend targeted for standard and premium ice cream recipes, providing smooth body, texture, and overrun stabilization. MASBLEN® 1201 is versatile and used in various premium and standard recipe ice creams. Its typical dosage is in the range of 0.45 to 0.6%, depending on the fat levels in the recipe.",
      "Ingredient Name": "Ice Cream Stabilizer",
      "Function": "Emulsifier, Stabilizer, Texturizing Agent",
      "Labeling Claims": "Kosher, GMO-free, Sustainable, Non-GMO, Allergen-free, PHO (Partially Hydrogenated Oil)-Free, Halal",
      "Certifications & Compliance": "GFSI Certified, ISO 14001, RSPO Certified Sustainable Palm Oil, FCC Compliant, Halal, JECFA (FAO/WHO), ISO 9001, Kosher, FSSC 22000, EU Compliant, GMP",
      "Physical Form": "Solid, Powder"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EB 1007 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-eb-1007",
    "product_details": {
      "description": "MASEMUL® EB 1007 improves dough handling in terms of machinability, volume, shelf life, and eating quality in frozen and fresh pizza dough formulas. MASEMUL® EB 1007 can also increase dough strength and improve texture and bite (short bite, crispness, and crunchy bite) in cookie recipes.",
      "Ingredient Name": "Emulsifier Blend",
      "Function": "Dough Strengthener",
      "Features": "Improved Texture, Enhanced Shelf Life, Improved Dough Machinability & Development, Improved Hydration, Improved Mouthfeel, Dough Improver",
      "Labeling Claims": "Non-GMO, Allergen-free, Halal, Kosher",
      "Certifications & Compliance": "Kosher, Non-GMO Project Verified, FDA Approved, Halal, EU Compliant",
      "End Uses": "Pizza, Cookies"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EM 3003 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-em-3003",
    "product_details": {
      "description": "MASEMUL® EM 3003 is a margarine that is widely used in laminated products such as croissants, danish, and other puff pastries to improve lamination and expansion. The plasticity of puff pastry margarine plays a vital role in the lamination process in order to ensure unbroken, homogeneous, thin layers of puff pastry margarine in the dough. This provides structure and volume to the laminated products. MASEMUL® EM 3003 is an emulsifier blend in pastilles form for puff pastry margarine application.",
      "Ingredient Name": "Emulsifier Blend",
      "Function": "Emulsifier",
      "Ingredient Origin": "Natural Origin, Plant Origin, Vegetable Origin",
      "Labeling Claims": "Non-GMO, Allergen-free, Halal, Kosher, Naturally Derived",
      "End Uses": "Puff Pastry, Croissant, Margarine"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EM 3004 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-em-3004",
    "product_details": {
      "description": "MASEMUL® EM 3004 is an emulsifier blend in paste form. It provides a stable emulsion for low-fat spread production. The low-fat spread contains a high proportion of water, emulsifiers, and stabilizers. It is intended for use in bread and other yeast goods applications to improve freshness, quality, and texture.",
      "Ingredient Name": "Emulsifier Blend",
      "Function": "Emulsifier, Stabilizer",
      "Ingredient Origin": "Natural Origin, Vegetable Origin, Plant Origin",
      "Labeling Claims": "Non-GMO, Allergen-free, Halal, Kosher, Naturally Derived",
      "Physical Form": "Paste",
      "Features": "Improved Dispersion, Emulsion Stabiliser, Low Fat, Improved Texture, Easy To Handle"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EB 1006 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-eb-1006",
    "product_details": {
      "description": "MASEMUL® EB 1006 is a specialized addition to bun and dough formulas, including baked, steamed, or fried. This product enhances handling and overal quality, increasing dough tolerance while delivering remarkable consistency. Also provides enhanced machinability, longer shelf life, and amplified bun volume.",
      "Ingredient Name": "Emulsifier Blend",
      "Function": "Dough Conditioner",
      "Features": "Improved Texture, Soft Texture, Smooth Texture, Enhanced Shelf Life, Fermentation Tolerance, Improved Dough Machinability & Development, Improved Hydration, Improved Mouthfeel, Dough Improver",
      "Labeling Claims": "Non-GMO, Allergen-free, Halal, Kosher",
      "Certifications & Compliance": "Kosher, Non-GMO Project Verified, FDA Approved, Halal, EU Compliant",
      "End Uses": "Buns"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EC 5102 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ec-5102",
    "product_details": {
      "description": "MASEMUL® EC 5102 is a liquid functional blend that imparts a lusciously smooth and creamy texture to fillings post-baking. Tailored to improve keep premium goods bake-stable, MASEMUL® EC 5102 specializes in chocolate and white center fillings, ensuring your creations reach new heights of indulgence.",
      "Ingredient Name": "Emulsifier Blend",
      "Function": "Emulsifier",
      "Labeling Claims": "Non-GMO, Allergen-free, Halal, Kosher",
      "Physical Form": "Liquid",
      "End Uses": "Filling Applications, Cookies"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EF 2003 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ef-2003",
    "product_details": {
      "description": "MASEMUL® EF 2003 is a premium emulsifier blend crafted for producing exceptional α-cake gel. This easy-handling pellet emulsifier ensures unparalleled stability and production reliability. Embrace the seamless performance of MASEMUL® EF 2003, a vital asset in the realm of food and nutrition applications.",
      "Function": "Emulsifier",
      "Physical Form": "Pellets, Solid",
      "End Uses": "Cake Gel"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EC 5101 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ec-5101",
    "product_details": {
      "description": "MASEMUL® EC 5101 is an integrated blend of fat and emulsifiers. It is used for baking stable-fat fillings in cookies. This product improves the bake-stable performance of cocoa and white-based fillings and maintains the smooth, creamy texture of the filling.",
      "Function": "Emulsifier, Fats & Oils",
      "Certifications & Compliance": "ISO 9001, FSSC 22000, GFSI Certified"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® STS 5002 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-sts-5002",
    "product_details": {
      "description": "MASEMUL® STS 5002 sorbitan tristearate is created by fusing refined vegetable fatty acids with sorbitol. As both an anti-crystallizing agent and an emulsifier, it excels at maintaining product integrity. Available in beads and solid forms, MASEMUL® STS 5002 finds its aptitude within cooking oils and fat products. Explore its prowess in enhancing culinary experiences within the food and nutrition sector, ensuring the highest quality in your creations.",
      "Ingredient Name": "Sorbitan Tristearate",
      "Function": "Anti-Crystalizing Agent, Emulsifier",
      "Labeling Claims": "PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, GMO-free, Sustainable, Non-Hazardous, Non-GMO",
      "Physical Form": "Beads, Solid",
      "Features": "Anti-Crystallization"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EB 1005 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-eb-1005",
    "product_details": {
      "description": "MASEMUL® EB 1005 emulsifier blend is a bread texture softener and dough strengthener. It offers a complete solution to bread manufacturers and doesn't require additional emulsifiers. MASEMUL® EB 1005 provides enhanced machinability, bread volume, shape retention, and extended shelf life.",
      "Ingredient Name": "Emulsifier Blend",
      "Function": "Dough Strengthener, Crumb Softener, Shelf Life Enhancer",
      "Labeling Claims": "Non-GMO, Allergen-free, Halal, Kosher",
      "Certifications & Compliance": "Non-GMO Project Verified, FDA Approved, Halal, EU Compliant, Kosher"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® SMS 5502 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-sms-5502",
    "product_details": {
      "description": "MASEMUL® SMS 5502 is a potent emulsifier - sorbitan monostearate, made through the fusion of refined vegetable fatty acids and sorbitol. Available as both beads and solids, MASEMUL® SMS 5502 has food and nutrition applications ranging from bakery endeavors to diverse culinary creations.",
      "Ingredient Name": "Sorbitan Monostearate",
      "Function": "Emulsifier",
      "Labeling Claims": "PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, GMO-free, Sustainable, Non-Hazardous, Non-GMO",
      "Physical Form": "Beads, Solid",
      "End Uses": "Instant Active Dry Yeast"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EF 2001 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ef-2001",
    "product_details": {
      "description": "MASEMUL® EF 2001 is a baking essential integrated into cake recipes, enhancing batter handling and overall cake quality. Witness improved softness and prolonged moisture retention throughout the product's shelf life. Combined with shortening, it enhances the creaming process of high-ratio cakes, promising exceptional culinary outcomes.",
      "Function": "Emulsifier, Shelf Life Enhancer",
      "Labeling Claims": "Kosher, Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal",
      "Physical Form": "Powder, Solid",
      "Features": "Soft Texture, Improved Texture, High Quality, Excellent Softness, Improved Water Retention, Batter Strength, Batter Aeration, Enhanced Shelf Life"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " Vitrenol® 20L ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/vitrenol-20l",
    "product_details": {
      "description": "Vitrenol® 20L is a natural liquid with a 20% Tocotrienol concentration, sourced from sustainable Palm oils. With an optimal 3:1 ratio of Tocotrienols to Tocopherols, Vitrenol® 20L is obtained through solvent-free extraction, ensuring a pure, chemical-free tocotrienol-rich fraction. Experience the benefits of Vitamin E with Vitrenol® 20L.",
      "Ingredient Name": "Tocotrienols",
      "Function": "Vitamin Source, Anti-Aging Agent",
      "Labeling Claims": "Kosher, Clean Label, Halal",
      "Certifications & Compliance": "Gluten-free, Prop 65 Compliant, Vegan, Halal, REACH Exempt (Europe), ISO 9001, Kosher, RSPO MassBalance Certified, FSSC 22000, GMP"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EM 3005 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-em-3005",
    "product_details": {
      "description": "MASEMUL® EM 3005 is a unique pastille-form emulsifier system crafted for puff pastry margarine applications. Its purpose is to enhance lamination and expansion, thereby elevating the quality of laminated products such as croissants, Danish pastries, and puff pastries. Vital for the lamination process, MASEMUL® EM 3005 ensures a consistent, homogeneous distribution of thin puff pastry margarine layers within the dough, resulting in laminated structures and improved volume of final product.",
      "Ingredient Name": "Emulsifier Blend",
      "Function": "Emulsifier",
      "Ingredient Origin": "Natural Origin, Vegetable Origin, Plant Origin",
      "Labeling Claims": "Non-GMO, Allergen-free, Halal, Kosher, Naturally Derived",
      "Physical Form": "Pastilles, Solid",
      "End Uses": "Margarine, Puff Pastry, Croissant"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EC 5001 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ec-5001",
    "product_details": {
      "description": "MASEMUL® EC 5001 is a triumph in thwarting oil separation within fat-based spreads. Embrace its unwavering stability, uniform texture, and exceptional spreadability. Bask in the luxurious high surface gloss it imparts, with the added delight of no large crystals forming on the surface. MASEMUL® EC 5001 is ideal in food and nutrition, shining in confectionery and convenience food applications.",
      "Function": "Emulsifier",
      "Labeling Claims": "Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher",
      "End Uses": "Chocolate Spreads, Filling Applications"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® SSL 2802 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ssl-2802",
    "product_details": {
      "description": "MASEMUL® SSL 2802 has applications including emulsification, dough conditioning, and dough strengthening. Presented in solid bead form, MASEMUL® SSL 2802 is used in many applications, including animal health and nutrition in agriculture, and beverages in food and nutrition.",
      "Ingredient Name": "Sodium Stearoyl Lactylate",
      "Function": "Emulsifier, Dough Conditioner, Dough Strengthener",
      "Labeling Claims": "Kosher, GMO-free, Sustainable, Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal, Non-Hazardous",
      "Certifications & Compliance": "FDA Approved, GFSI Certified, ISO 14001, RSPO Certified Sustainable Palm Oil, FCC Compliant, Halal, JECFA (FAO/WHO), ISO 9001, FDA 21 CFR 172.846, Kosher, FSSC 22000, EU Compliant, GMP",
      "Physical Form": "Solid, Beads"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EC 5401 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ec-5401",
    "product_details": {
      "description": "MASEMUL® EC 5401 is a blend of triglycerides based on fully hydrogenated vegetable oil and mono (E471). This product is suitable for fat-based confectionery fillings, including shortening for wafer fillings and biscuit creams. MASEMUL® EC 5401 is an integrated blend of fat and emulsifier to improve crystallization for fat-based fillings.",
      "Ingredient Name": "Emulsifier Blend",
      "Function": "Crystalizing Agent, Fatty Acids & Lipids",
      "Physical Form": "Pastilles, Solid"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EM 3001 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-em-3001",
    "product_details": {
      "description": "MASEMUL® EM 3001 is an industrial margarine renowned in bakery and confectionery applications. It serves as a vital fat source, contributing structure and delightful taste attributes to products. MASEMUL® EM 3001 is a versatile cake and cream margarine tailored for pound cakes, fat-based bakery fillings, toppings, and short-crust pastries, ensuring exceptional results in every creation.",
      "Function": "Emulsifier, Whipping Agent",
      "Labeling Claims": "PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, Non-GMO",
      "Features": "Smooth Texture, Excellent Stability, Improved Expansion, Good whipping ability, Creamy Texture, Improved Mouthfeel, Excellent Mouthfeel, Improved Water Retention, Improved Stability"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® OB 1015 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ob-1015",
    "product_details": {
      "description": "MASEMUL® OB 1015 provides non-hydrogenated, trans-free, and non-GMO vegetable-based triglycerides. Functions include fatty acids and lipids, offering valuable attributes. In food and nutrition, MASEMUL® OB 1015 is used in bakery, confectionery, cooking oils and fat products, dairy, desserts, and fruit preparations.",
      "Ingredient Name": "Triglyceride",
      "Function": "Fatty Acids & Lipids",
      "Ingredient Origin": "Natural Origin, Plant Origin, Vegetable Origin",
      "Labeling Claims": "Non-GMO, Trans fat-free, Naturally Derived"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® MDG 4502 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-mdg-4502",
    "product_details": {
      "description": "MASEMUL® MDG 4502 is a vital component enhancing chewing gum bases and candies. Functions include: Emulsification, anti-sticking, and extrusion aid. Operating within the agriculture and feed, food and nutrition, and printing and packaging markets, MASEMUL® MDG 4502 contributes to diverse industries.",
      "Ingredient Name": "Mono Diglyceride",
      "Function": "Emulsifier, Anti-Sticking Agent, Extrusion Aid",
      "Chemical Family": "Glycerides",
      "Labeling Claims": "Kosher, PHO (Partially Hydrogenated Oil)-Free, GMO-free, Allergen-free, Non-GMO, Sustainable, Halal, Non-Hazardous",
      "Certifications & Compliance": "ISO 14001, FSSC 22000, GFSI Certified, FCC Compliant, Kosher, GMP, JECFA (FAO/WHO), EU Compliant, FDA Approved, RSPO Certified Sustainable Palm Oil, Halal, ISO 9001"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EF 2005 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ef-2005",
    "product_details": {
      "description": "MASEMUL® EF 2005 is a specialized emulsifier blend designed for producing α-cake gel, particularly in propylene glycol-free formulations. Crafted in easy-to-handle pellet form, this emulsifier ensures cake gels boast exceptional stability and whipping ability. A versatile solution for food and nutrition applications, especially for baking.",
      "Function": "Emulsifier",
      "Physical Form": "Pellets, Solid",
      "End Uses": "Cake Batters, Cake Gel"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EM 3002 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-em-3002",
    "product_details": {
      "description": "MASEMUL® EM 3002 is a versatile, vegetable oil-based margarine designed for a wide array of applications, from spreading and shallow frying to baking. Emulsifier blends like MASEMUL® EM 3002 enhance emulsion stability and margarine performance, ensuring exceptional culinary results across the board.",
      "Function": "Emulsifier",
      "Labeling Claims": "Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher",
      "End Uses": "Margarine"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EF 2004 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ef-2004",
    "product_details": {
      "description": "MASEMUL® EF 2004 is an emulsifier blend. It provides good stability and improves cake batter quality. MASEMUL® EF 2004 is also used for producing standard α-cake gel and is ideal for use within the vertical mixer production of all types of cake.",
      "Function": "Emulsifier",
      "Physical Form": "Pellets, Solid",
      "End Uses": "Cake Batters, Cake Gel"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® MDG 6002 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-mdg-6002",
    "product_details": {
      "description": "MASEMUL® MDG 6002 is a specialized ingredient, vital for ice cream perfection. Serving as an emulsifier, it contributes to the smooth texture and consistent quality of ice cream. Available in both bead and solid forms, MASEMUL® MDG 6002 finds its applications in a wide range of food and nutrition domains, including bakery, confectionery, cooking oils and fat products, dairy, desserts, and fruit preparations, as well as savory and culinary creations.",
      "Ingredient Name": "Mono Diglyceride",
      "Function": "Emulsifier",
      "Labeling Claims": "Halal, Kosher",
      "Physical Form": "Beads, Solid",
      "End Uses": "Frozen Desserts, Margarine"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EF 25 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ef-25",
    "product_details": {
      "description": "MASEMUL® EF 25 is a batter conditioner and emulsifier seamlessly integrated into cake recipes, enhancing batter handling and overall cake quality. It improves softness and moisture retention throughout the product's shelf life. When combined with shortening, it enhances the creaming process of high-ratio cakes, promising exceptional culinary outcomes.",
      "Function": "Emulsifier, Batter Conditioner, Shelf Life Enhancer",
      "Labeling Claims": "PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, Non-GMO",
      "Certifications & Compliance": "ISO 9001, GFSI Certified, RSPO Certified Sustainable Palm Oil, Kosher, FSSC 22000, Halal",
      "Physical Form": "Paste"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® EC 5002 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ec-5002",
    "product_details": {
      "description": "MASEMUL® EC 5002 is a remarkable offering. Its role is centered around fatty acids and lipids, and it proudly bears the labeling claims of being Non-GMO, trans-fat-free, and naturally derived. in the realm of food and nutrition, MASEMUL® EC 5002 finds its applications in bakery, confectionery, cooking oils and fat products, dairy, desserts, and fruit preparations, as well as in savory and culinary creations.",
      "Ingredient Name": "Triglyceride",
      "Function": "Fatty Acids & Lipids",
      "Ingredient Origin": "Natural Origin, Plant Origin, Vegetable Origin",
      "Labeling Claims": "Non-GMO, Trans fat-free, Naturally Derived"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " INTERPALM 12B ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/interpalm-12b",
    "product_details": {
      "description": "INTERPALM 12B is a refined, hard fractionated palm oil designed for confectionery excellence. As a crystallization starter, stabilizer, and robust component INTERPALM 12B elevates your food creations to new heights. Unleash its potential in the world of confectionery, ensuring delightful and consistent results.",
      "Ingredient Name": "Palm Stearin",
      "Function": "Crystalizing Agent, Fats & Oils, Stabilizer",
      "Labeling Claims": "Kosher, Allergen-free, Halal",
      "Certifications & Compliance": "Gluten-free, Prop 65 Compliant, Vegan, Halal, REACH Exempt (Europe), ISO 9001, Kosher, RSPO MassBalance Certified, FSSC 22000",
      "Physical Form": "Solid"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® SSL 3302 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-ssl-3302",
    "product_details": {
      "description": "MASEMUL® SSL 3302 is crafted through the fusion of refined fatty acids with lactic acid; its prowess spans multiple functions: Emulsification, clouding, dough conditioning, dough strengthening, and whipping. MASEMUL® SSL 3302 has applications in animal health and nutrition, agriculture and feed, beverage, and food and nutrition",
      "Ingredient Name": "Sodium Stearoyl Lactylate",
      "Function": "Emulsifier, Clouding Agent, Dough Conditioner, Dough Strengthener, Whipping Agent",
      "Labeling Claims": "Kosher, GMO-free, Sustainable, Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal, Non-Hazardous",
      "Certifications & Compliance": "FDA Approved, GFSI Certified, ISO 14001, RSPO Certified Sustainable Palm Oil, FCC Compliant, Halal, JECFA (FAO/WHO), ISO 9001, Kosher, FSSC 22000, EU Compliant, GMP",
      "Physical Form": "Solid, Beads"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® PGPR 9090 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-pgpr-9090",
    "product_details": {
      "description": "MASEMUL® PGPR 9090 is a potent polyglycerol polyricinoleate emulsifier created with refined castor oil fatty acids and polyglycerol. Found in liquid form, its impact resonates across the spectrum of food and nutrition. From confectionery, convenience foods, desserts, and fruit preparations to compound chocolate and ice cream coatings, it offers unparalleled benefits.",
      "Ingredient Name": "Polyglycerol Polyricinoleate",
      "Function": "Emulsifier",
      "Labeling Claims": "PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, Non-GMO",
      "End Uses": "Compound Chocolate Coating, Compound Ice Cream Coating, Chocolates, Spreads"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 3201 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-3201",
    "product_details": {
      "description": "MASBLEN 3201 is a precision-engineered powder blend of food-grade emulsifiers and stabilizers. Crafted from non-animal, non-GMO sources, it excels in frozen yogurt applications. Safeguard your frozen delights during distribution and storage with MASBLEN 3201, preventing heat shock damage and ensuring a delightful, consistent experience. See below for certifications, recipe suggestion, and other information.",
      "Function": "Emulsifier, Stabilizer",
      "Labeling Claims": "Non-GMO",
      "Physical Form": "Powder, Solid",
      "Features": "Heat Stability, Excellent Melt Resistance, Creamy Texture, Shape Retention, Emulsifying, Smooth Texture, Batter Aeration"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " Goldbeads® S36 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/goldbeads-s36",
    "product_details": {
      "description": "Goldbeads® S36 is a meticulously crafted, fully hydrogenated palm stearine presented in convenient bead form. Applications include:",
      "Ingredient Name": "Palm Stearin",
      "Function": "Crystalizing Agent, Encapsulant, Emulsifier, Fats & Oils, Stabilizer",
      "Labeling Claims": "Kosher, Allergen-free, Halal",
      "Certifications & Compliance": "Gluten-free, Prop 65 Compliant, Vegan, Halal, REACH Exempt (Europe), ISO 9001, Kosher, RSPO MassBalance Certified, FSSC 22000",
      "Physical Form": "Solid, Beads"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 1102 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-1102",
    "product_details": {
      "description": "MASBLEN® 1102 is a remarkable powder blend of food-grade Emulsifiers and Stabilizers. Crafted from non-animal, non-GMO sources, it shines in ice cream and milk ice recipes. Provides impeccable air incorporation, finely distributed air, and steadfast overrun. Elevate your frozen delights with MASBLEN® 1102.",
      "Function": "Emulsifier, Stabilizer",
      "Labeling Claims": "Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, Animal Products-free",
      "Physical Form": "Powder",
      "Features": "Texturizing, Excellent Melt Resistance, Shape Retention, Creamy Texture, Stabilizing"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 2201 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-2201",
    "product_details": {
      "description": "MASBLEN® 2201 is a versatile ingredient with key functions as an emulsifier, stabilizer, and texturizing agent. It offers the notable benefit of promoting excellent aeration, resulting in a smooth and creamy texture. MASBLEN® 2201 finds its applications in the realm of Food and Nutrition, where it enhances various products. The exceptional aeration and texturizing capabilities of MASBLEN® 2201 improve the texture and quality of your food formulations. See below for suggested recipe and other information.",
      "Function": "Emulsifier, Stabilizer, Texturizing Agent",
      "Labeling Claims": "Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher",
      "Features": "Creamy Mouthfeel"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 5101 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-5101",
    "product_details": {
      "description": "MASBLEN® 5101 is a potent blend of food-grade emulsifiers and stabilizers in powdered form. Crafted to ensure uniform suspension of plant-based proteins and other insoluble particles, it enhances emulsion stability while curbing creaming tendencies. This versatile functional system finds its prime use in dairy-alternative beverages, making MASBLEN® 5101 an essential ingredient for elevating your plant-based refreshments.",
      "Function": "Emulsifier, Stabilizer",
      "Physical Form": "Powder, Solid",
      "Features": "Improved suspension, Improved Mouthfeel, Emulsifying, Prevents Fat Separation, Heat Stability"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 1401 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-1401",
    "product_details": {
      "description": "MASBLEN® 1401 is a premium powder blend of food-grade emulsifiers and stabilizers, sourced from non-animal, non-GMO origins. Tailored for low-calorie ice cream and milk ice applications, it enhances mix viscosity and air incorporation. MASBLEN® 1401 delivers a lusciously creamy texture with a substantial body and simplifies production of low-calorie ice cream.",
      "Function": "Emulsifier, Stabilizer",
      "Labeling Claims": "Non-GMO",
      "Physical Form": "Powder, Solid",
      "Features": "Heat Stability, Excellent Melt Resistance, Creamy Texture, Calorie Reduction, High Overrun, Prevent Shrinkage, Emulsifying, Low Calorie"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 2202 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-2202",
    "product_details": {
      "description": "MASBLEN® 2202 is a versatile ingredient that functions as an emulsifier, stabilizer, and texturizing agent. Made for Food and Nutrition applications, it provides desirable standup, creamy mouthfeel, and enhanced melt resistance, particularly beneficial for soft-serve ice cream. See below for recipe and other information.",
      "Function": "Emulsifier, Stabilizer, Texturizing Agent",
      "Labeling Claims": "Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher",
      "Features": "Creamy Mouthfeel"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 3102 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-3102",
    "product_details": {
      "description": "MASBLEN 3102 is an emulsifier, stabilizer, and texturizing agent for use in Food and Nutrition applications. It provides exceptional aeration and delivers an exceedingly smooth and creamy texture, good body, and melt-resistant qualities. Experience the remarkable texture-enhancing capabilities of MASBLEN 3102 in your food products.",
      "Function": "Emulsifier, Stabilizer, Texturizing Agent",
      "Labeling Claims": "Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher",
      "Features": "Creamy Mouthfeel"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 1202 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-1202",
    "product_details": {
      "description": "MASBLEN® 1202 is a remarkable powder blend of food-grade Emulsifiers and Stabilizers. It can also function as a texturizing agent. Derived from non-animal, non-GMO sources, it excels in ice cream and milk ice recipes. Safeguard your creations during distribution and storage with MASBLEN® 1202, preventing heat shock damage, curbing coarse ice crystal growth, and preserving optimal texture.",
      "Function": "Emulsifier, Stabilizer, Texturizing Agent",
      "Labeling Claims": "PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, Non-GMO",
      "Features": "Stabilizing, Uniform Texture, Texturizing"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 6801 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-6801",
    "product_details": {
      "description": "MASBLEN® 6801 is a specialized emulsifier with features that include improved mouthfeel and fat reduction. Its Food and Nutrition applications include creating reduced-fat, egg-free mayonnaise. MASBLEN® 6801 contributes essential emulsification properties and enhances the mouthfeel of mayonnaise, even in reduced-fat formulations.",
      "Function": "Emulsifier",
      "Labeling Claims": "Non-GMO, Halal, Kosher",
      "Features": "Improved Mouthfeel, Fat Reduction"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 2102 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-2102",
    "product_details": {
      "description": "MASBLEN® 2102 is a skillfully crafted blend of food-grade emulsifiers and stabilizers in powder form. Derived from non-animal, non-GMO sources, this product is tailored for incorporation into soft-serve ice cream dry mix. Its remarkable attributes include superior melt resistance, shape retention, and a luxuriously smooth and creamy texture. Elevate your sensory journey with enhanced standup and elegant fluting characteristics, all courtesy of MASBLEN® 2102.",
      "Function": "Emulsifier, Stabilizer",
      "Labeling Claims": "Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, Animal Products-free",
      "Physical Form": "Powder",
      "Features": "Smooth Texture, Excellent Melt Resistance, Shape Retention, Creamy Texture, Creamy Mouthfeel, Improved Mouthfeel"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 5102 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-5102",
    "product_details": {
      "description": "MASBLEN® 5102 is a powder blend of food-grade emulsifiers and stabilizers. It provides a uniform suspension of plant-based proteins and other insoluble particles and improves emulsion stability, reducing the tendency for creaming. This product is a versatile functional system for use in UHT-alternative beverages such as UHT oat soymilk and calcium-fortified matcha soymilk.",
      "Function": "Emulsifier, Stabilizer",
      "Physical Form": "Powder, Solid",
      "Features": "Prevents Fat Separation, Heat Stability, Consistent Suspension, Improved suspension, Improved Mouthfeel, Emulsifying"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 6151 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-6151",
    "product_details": {
      "description": "MASBLEN 6151 is a purpose-built functional blend of meticulously chosen emulsifiers and hydrocolloids. Tailored for dairy-free and protein-free whipped topping applications, it excels in delivering remarkable foam stability and syneresis control. It also provides enhanced freeze-thaw stability, minimal shrinkage, and reduced syneresis.",
      "Function": "Emulsifier, Whipping Agent",
      "Labeling Claims": "PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher, Dairy-free, GMO-free, Non-GMO",
      "Features": "Smooth Texture, Soft Texture, Improved Freeze/Thaw Stability, Foam Stability, Good Consistency, High Overrun"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASBLEN® 3101 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masblen-3101",
    "product_details": {
      "description": "MASBLEN 3101 is a versatile ingredient, serving as an emulsifier, stabilizer, and texturizing agent for Food and Nutrition applications, specifically dairy, desserts, and fruit preparations, such as ice cream and frozen yogurt. MASBLEN 3101 enhances the texture and stability of your food products and elevates the quality and sensory experience of dairy-based and dessert formulations.",
      "Function": "Emulsifier, Stabilizer, Texturizing Agent",
      "Labeling Claims": "Non-GMO, PHO (Partially Hydrogenated Oil)-Free, Halal, Kosher",
      "Features": "Creamy Mouthfeel"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® DMG 9502H ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-dmg-9502h",
    "product_details": {
      "description": "MASEMUL® DMG 9502H is a key player in the creation of margarine and bakery products. Its role as an emulsifier contributes to the quality and performance of these food items. Within the markets of food and nutrition, printing, and packaging, MASEMUL® DMG 9502H finds its significance, enhancing both the culinary and packaging aspects of your products.",
      "Ingredient Name": "Distilled Monoglycerides",
      "Function": "Emulsifier",
      "Chemical Family": "Monoglycerides",
      "Labeling Claims": "PHO (Partially Hydrogenated Oil)-Free, Halal, GMO-free, Allergen-free, Non-Hazardous, Non-GMO, Kosher, Sustainable"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® AMG 9002 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-amg-9002",
    "product_details": {
      "description": "MASEMUL® AMG 9002 is an acetic acid ester of monoglycerides derived from fully hydrogenated palm-based oil. It is an emulsifier with a number of food and nutrition appliciations including:",
      "Ingredient Name": "Acetic Acid Ester Of Mono-Diglycerides",
      "Function": "Emulsifier",
      "End Uses": "Frozen Desserts, Margarine"
    },
    "company_name": "Musim Mas Group"
  },
  {
    "product_name": " MASEMUL® DMG 9502 ",
    "link": "https://www.knowde.com/stores/musim-mas-group/products/masemul-dmg-9502",
    "product_details": {
      "description": "MASEMUL® DMG 9502 is a versatile ingredient used in margarine, bakery products, and coffee whiteners. It acts as an emulsifier and extrusion aid, contributing to the quality and performance of various food products. Applications include agriculture and feed, food and nutrition, printing, and packaging markets. MASEMUL® DMG 9502 brings its unique benefits to a wide array of industries.",
      "Ingredient Name": "Distilled Monoglycerides",
      "Function": "Emulsifier, Extrusion Aid",
      "Chemical Family": "Monoglycerides",
      "Labeling Claims": "Kosher, PHO (Partially Hydrogenated Oil)-Free, GMO-free, Allergen-free, Non-GMO, Sustainable, Halal, Non-Hazardous",
      "Certifications & Compliance": "ISO 14001, FSSC 22000, GFSI Certified, FCC Compliant, Kosher, GMP, JECFA (FAO/WHO), EU Compliant, FDA Approved, RSPO Certified Sustainable Palm Oil, Halal, ISO 9001"
    },
    "company_name": "Musim Mas Group"
  }
]
